GopalSaraf/Practicals/PSDL/include/proc/pic16lf1934.inc
// Register: PWM2CON
#define PWM2CON PWM2CON
PWM2CON                                  equ 029Bh
// bitfield definitions
PWM2CON_P2DC0_POSN                       equ 0000h
PWM2CON_P2DC0_POSITION                   equ 0000h
PWM2CON_P2DC0_SIZE                       equ 0001h
PWM2CON_P2DC0_LENGTH                     equ 0001h
PWM2CON_P2DC0_MASK                       equ 0001h
PWM2CON_P2DC1_POSN                       equ 0001h
PWM2CON_P2DC1_POSITION                   equ 0001h
PWM2CON_P2DC1_SIZE                       equ 0001h
PWM2CON_P2DC1_LENGTH                     equ 0001h
PWM2CON_P2DC1_MASK                       equ 0002h
PWM2CON_P2DC2_POSN                       equ 0002h
PWM2CON_P2DC2_POSITION                   equ 0002h
PWM2CON_P2DC2_SIZE                       equ 0001h
PWM2CON_P2DC2_LENGTH                     equ 0001h
PWM2CON_P2DC2_MASK                       equ 0004h
PWM2CON_P2DC3_POSN                       equ 0003h
PWM2CON_P2DC3_POSITION                   equ 0003h
PWM2CON_P2DC3_SIZE                       equ 0001h
PWM2CON_P2DC3_LENGTH                     equ 0001h
PWM2CON_P2DC3_MASK                       equ 0008h
PWM2CON_P2DC4_POSN                       equ 0004h
PWM2CON_P2DC4_POSITION                   equ 0004h
PWM2CON_P2DC4_SIZE                       equ 0001h
PWM2CON_P2DC4_LENGTH                     equ 0001h
PWM2CON_P2DC4_MASK                       equ 0010h
PWM2CON_P2DC5_POSN                       equ 0005h
PWM2CON_P2DC5_POSITION                   equ 0005h
PWM2CON_P2DC5_SIZE                       equ 0001h
PWM2CON_P2DC5_LENGTH                     equ 0001h
PWM2CON_P2DC5_MASK                       equ 0020h
PWM2CON_P2DC6_POSN                       equ 0006h
PWM2CON_P2DC6_POSITION                   equ 0006h
PWM2CON_P2DC6_SIZE                       equ 0001h
PWM2CON_P2DC6_LENGTH                     equ 0001h
PWM2CON_P2DC6_MASK                       equ 0040h
PWM2CON_P2RSEN_POSN                      equ 0007h
PWM2CON_P2RSEN_POSITION                  equ 0007h
PWM2CON_P2RSEN_SIZE                      equ 0001h
PWM2CON_P2RSEN_LENGTH                    equ 0001h
PWM2CON_P2RSEN_MASK                      equ 0080h

// Register: CCP2AS
#define CCP2AS CCP2AS
CCP2AS                                   equ 029Ch
// bitfield definitions
CCP2AS_PSS2BD0_POSN                      equ 0000h
CCP2AS_PSS2BD0_POSITION                  equ 0000h
CCP2AS_PSS2BD0_SIZE                      equ 0001h
CCP2AS_PSS2BD0_LENGTH                    equ 0001h
CCP2AS_PSS2BD0_MASK                      equ 0001h
CCP2AS_PSS2BD1_POSN                      equ 0001h
CCP2AS_PSS2BD1_POSITION                  equ 0001h
CCP2AS_PSS2BD1_SIZE                      equ 0001h
CCP2AS_PSS2BD1_LENGTH                    equ 0001h
CCP2AS_PSS2BD1_MASK                      equ 0002h
CCP2AS_PSS2AC0_POSN                      equ 0002h
CCP2AS_PSS2AC0_POSITION                  equ 0002h
CCP2AS_PSS2AC0_SIZE                      equ 0001h
CCP2AS_PSS2AC0_LENGTH                    equ 0001h
CCP2AS_PSS2AC0_MASK                      equ 0004h
CCP2AS_PSS2AC1_POSN                      equ 0003h
CCP2AS_PSS2AC1_POSITION                  equ 0003h
CCP2AS_PSS2AC1_SIZE                      equ 0001h
CCP2AS_PSS2AC1_LENGTH                    equ 0001h
CCP2AS_PSS2AC1_MASK                      equ 0008h
CCP2AS_CCP2AS0_POSN                      equ 0004h
CCP2AS_CCP2AS0_POSITION                  equ 0004h
CCP2AS_CCP2AS0_SIZE                      equ 0001h
CCP2AS_CCP2AS0_LENGTH                    equ 0001h
CCP2AS_CCP2AS0_MASK                      equ 0010h
CCP2AS_CCP2AS1_POSN                      equ 0005h
CCP2AS_CCP2AS1_POSITION                  equ 0005h
CCP2AS_CCP2AS1_SIZE                      equ 0001h
CCP2AS_CCP2AS1_LENGTH                    equ 0001h
CCP2AS_CCP2AS1_MASK                      equ 0020h
CCP2AS_CCP2AS2_POSN                      equ 0006h
CCP2AS_CCP2AS2_POSITION                  equ 0006h
CCP2AS_CCP2AS2_SIZE                      equ 0001h
CCP2AS_CCP2AS2_LENGTH                    equ 0001h
CCP2AS_CCP2AS2_MASK                      equ 0040h
CCP2AS_CCP2ASE_POSN                      equ 0007h
CCP2AS_CCP2ASE_POSITION                  equ 0007h
CCP2AS_CCP2ASE_SIZE                      equ 0001h
CCP2AS_CCP2ASE_LENGTH                    equ 0001h
CCP2AS_CCP2ASE_MASK                      equ 0080h

// Register: PSTR2CON
#define PSTR2CON PSTR2CON
PSTR2CON                                 equ 029Dh
// bitfield definitions
PSTR2CON_STR2A_POSN                      equ 0000h
PSTR2CON_STR2A_POSITION                  equ 0000h
PSTR2CON_STR2A_SIZE                      equ 0001h
PSTR2CON_STR2A_LENGTH                    equ 0001h
PSTR2CON_STR2A_MASK                      equ 0001h
PSTR2CON_STR2B_POSN                      equ 0001h
PSTR2CON_STR2B_POSITION                  equ 0001h
PSTR2CON_STR2B_SIZE                      equ 0001h
PSTR2CON_STR2B_LENGTH                    equ 0001h
PSTR2CON_STR2B_MASK                      equ 0002h
PSTR2CON_STR2C_POSN                      equ 0002h
PSTR2CON_STR2C_POSITION                  equ 0002h
PSTR2CON_STR2C_SIZE                      equ 0001h
PSTR2CON_STR2C_LENGTH                    equ 0001h
PSTR2CON_STR2C_MASK                      equ 0004h
PSTR2CON_STR2D_POSN                      equ 0003h
PSTR2CON_STR2D_POSITION                  equ 0003h
PSTR2CON_STR2D_SIZE                      equ 0001h
PSTR2CON_STR2D_LENGTH                    equ 0001h
PSTR2CON_STR2D_MASK                      equ 0008h
PSTR2CON_STR2SYNC_POSN                   equ 0004h
PSTR2CON_STR2SYNC_POSITION               equ 0004h
PSTR2CON_STR2SYNC_SIZE                   equ 0001h
PSTR2CON_STR2SYNC_LENGTH                 equ 0001h
PSTR2CON_STR2SYNC_MASK                   equ 0010h

// Register: CCPTMRS0
#define CCPTMRS0 CCPTMRS0
CCPTMRS0                                 equ 029Eh
// bitfield definitions
CCPTMRS0_C1TSEL0_POSN                    equ 0000h
CCPTMRS0_C1TSEL0_POSITION                equ 0000h
CCPTMRS0_C1TSEL0_SIZE                    equ 0001h
CCPTMRS0_C1TSEL0_LENGTH                  equ 0001h
CCPTMRS0_C1TSEL0_MASK                    equ 0001h
CCPTMRS0_C1TSEL1_POSN                    equ 0001h
CCPTMRS0_C1TSEL1_POSITION                equ 0001h
CCPTMRS0_C1TSEL1_SIZE                    equ 0001h
CCPTMRS0_C1TSEL1_LENGTH                  equ 0001h
CCPTMRS0_C1TSEL1_MASK                    equ 0002h
CCPTMRS0_C2TSEL0_POSN                    equ 0002h
CCPTMRS0_C2TSEL0_POSITION                equ 0002h
CCPTMRS0_C2TSEL0_SIZE                    equ 0001h
CCPTMRS0_C2TSEL0_LENGTH                  equ 0001h
CCPTMRS0_C2TSEL0_MASK                    equ 0004h
CCPTMRS0_C2TSEL1_POSN                    equ 0003h
CCPTMRS0_C2TSEL1_POSITION                equ 0003h
CCPTMRS0_C2TSEL1_SIZE                    equ 0001h
CCPTMRS0_C2TSEL1_LENGTH                  equ 0001h
CCPTMRS0_C2TSEL1_MASK                    equ 0008h
CCPTMRS0_C3TSEL0_POSN                    equ 0004h
CCPTMRS0_C3TSEL0_POSITION                equ 0004h
CCPTMRS0_C3TSEL0_SIZE                    equ 0001h
CCPTMRS0_C3TSEL0_LENGTH                  equ 0001h
CCPTMRS0_C3TSEL0_MASK                    equ 0010h
CCPTMRS0_C3TSEL1_POSN                    equ 0005h
CCPTMRS0_C3TSEL1_POSITION                equ 0005h
CCPTMRS0_C3TSEL1_SIZE                    equ 0001h
CCPTMRS0_C3TSEL1_LENGTH                  equ 0001h
CCPTMRS0_C3TSEL1_MASK                    equ 0020h
CCPTMRS0_C4TSEL0_POSN                    equ 0006h
CCPTMRS0_C4TSEL0_POSITION                equ 0006h
CCPTMRS0_C4TSEL0_SIZE                    equ 0001h
CCPTMRS0_C4TSEL0_LENGTH                  equ 0001h
CCPTMRS0_C4TSEL0_MASK                    equ 0040h
CCPTMRS0_C4TSEL1_POSN                    equ 0007h
CCPTMRS0_C4TSEL1_POSITION                equ 0007h
CCPTMRS0_C4TSEL1_SIZE                    equ 0001h
CCPTMRS0_C4TSEL1_LENGTH                  equ 0001h
CCPTMRS0_C4TSEL1_MASK                    equ 0080h
CCPTMRS0_C1TSEL_POSN                     equ 0000h
CCPTMRS0_C1TSEL_POSITION                 equ 0000h
CCPTMRS0_C1TSEL_SIZE                     equ 0002h
CCPTMRS0_C1TSEL_LENGTH                   equ 0002h
CCPTMRS0_C1TSEL_MASK                     equ 0003h
CCPTMRS0_C2TSEL_POSN                     equ 0002h
CCPTMRS0_C2TSEL_POSITION                 equ 0002h
CCPTMRS0_C2TSEL_SIZE                     equ 0002h
CCPTMRS0_C2TSEL_LENGTH                   equ 0002h
CCPTMRS0_C2TSEL_MASK                     equ 000Ch
CCPTMRS0_C3TSEL_POSN                     equ 0004h
CCPTMRS0_C3TSEL_POSITION                 equ 0004h
CCPTMRS0_C3TSEL_SIZE                     equ 0002h
CCPTMRS0_C3TSEL_LENGTH                   equ 0002h
CCPTMRS0_C3TSEL_MASK                     equ 0030h
CCPTMRS0_C4TSEL_POSN                     equ 0006h
CCPTMRS0_C4TSEL_POSITION                 equ 0006h
CCPTMRS0_C4TSEL_SIZE                     equ 0002h
CCPTMRS0_C4TSEL_LENGTH                   equ 0002h
CCPTMRS0_C4TSEL_MASK                     equ 00C0h

// Register: CCPTMRS1
#define CCPTMRS1 CCPTMRS1
CCPTMRS1                                 equ 029Fh
// bitfield definitions
CCPTMRS1_C5TSEL0_POSN                    equ 0000h
CCPTMRS1_C5TSEL0_POSITION                equ 0000h
CCPTMRS1_C5TSEL0_SIZE                    equ 0001h
CCPTMRS1_C5TSEL0_LENGTH                  equ 0001h
CCPTMRS1_C5TSEL0_MASK                    equ 0001h
CCPTMRS1_C5TSEL1_POSN                    equ 0001h
CCPTMRS1_C5TSEL1_POSITION                equ 0001h
CCPTMRS1_C5TSEL1_SIZE                    equ 0001h
CCPTMRS1_C5TSEL1_LENGTH                  equ 0001h
CCPTMRS1_C5TSEL1_MASK                    equ 0002h
CCPTMRS1_C5TSEL_POSN                     equ 0000h
CCPTMRS1_C5TSEL_POSITION                 equ 0000h
CCPTMRS1_C5TSEL_SIZE                     equ 0002h
CCPTMRS1_C5TSEL_LENGTH                   equ 0002h
CCPTMRS1_C5TSEL_MASK                     equ 0003h

